//
//  main.swift
//  Homework_2
//
//  Created by VADIM KUZNETSOV on 08/03/2019.
//  Copyright © 2019 VADIM KUZNETSOV. All rights reserved.
//

import Foundation

// Задание 1: Написать функцию, которая определяет, четное число или нет.


//func number(_a: Int) -> Bool {
//    return _a%2==0
//}
//print(number(_a: ))

//======================================================================================

// Задание 2: Написать функцию, которая определяет, делится ли число без остатка на 3.

//func number(_a: Int) -> Bool {
//    return _a%3==0
//}
//print(number(_a: ))

//======================================================================================

// Задание 3: Создать возрастающий массив из 100 чисел.

//var array = [Int](0...100)
//print(array)

//======================================================================================


// *Задание 4: Удалить из этого массива все четные числа и все числа, которые не делятся на 3.
//
//var array = [Int](0...100)
//var filteredNums = array.drop(while: {$0 % 2==0} && {$0 % 3==0})
//print(filteredNums)

// ??? Не понимаю почему не работает ((
//======================================================================================


